==================
Identifier
==================
{{ user }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (identifier)))))

==================
Null 1
==================
{{ null }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (null)))))

==================
Null 2
==================
{{ none }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (null)))))

==================
Interger
==================
{{ 42 }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (number)))))

==================
Float
==================
{{ 42.35 }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (number)))))

==================
True
==================
{{ true }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (boolean)))))

==================
False
==================
{{ false }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (boolean)))))

==================
String
==================
{{ 'hello' }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (string)))))

==================
String Interpolation 1
==================
{{ "foo #{"foo #{bar} baz"} baz" }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (interpolated_string
          (expression
            (primary_expression
              (interpolated_string
                (expression
                  (primary_expression
                    (identifier)))))))))))

==================
String Interpolation 2
==================
{{ "foo #{bar}#{bar} baz" }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (interpolated_string
          (expression
            (primary_expression
              (identifier)))
          (expression
            (primary_expression
              (identifier))))))))

==================
Empty array
==================
{{ [] }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (array)))))

==================
Array
==================
{{ [1, 2, 'foo', "bar"] }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (array
          (expression
            (primary_expression
              (number)))
          (expression
            (primary_expression
              (number)))
          (expression
            (primary_expression
              (string)))
          (expression
            (primary_expression
              (string))))))))

==================
Empty object
==================
{{ {} }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (object)))))

==================
Object
==================
{{ {'foo': 'bar'} }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (object
          (pair
            (string)
            (expression
              (primary_expression
                (string)))))))))

==================
Property keys as names
==================
{{ { foo: 'foo', bar: 'bar' } }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (object
          (pair
            (string)
            (expression
              (primary_expression
                (string))))
          (pair
            (string)
            (expression
              (primary_expression
                (string)))))))))

==================
Property keys as integer
==================
{{ { 2: 'foo', 4: 'bar' } }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (object
          (pair
            (number)
            (expression
              (primary_expression
                (string))))
          (pair
            (number)
            (expression
              (primary_expression
                (string)))))))))

==================
Property as the variable name
==================
{{ { foo } }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (object
          (string))))))

==================
Parentheses property
==================
{{ { (foo): 'foo' } }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (object
          (pair
            (computed_property_name
              (expression
                (primary_expression
                  (identifier))))
            (expression
              (primary_expression
                (string)))))))))

==================
Arrow function
==================
{{ (a, b) => 42 }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (arrow_function
          (formal_parameters
            (pattern
              (identifier))
            (pattern
              (identifier)))
          (expression
            (primary_expression
              (number))))))))

==================
Arrow function empty params
==================
{{ () => 42 }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (arrow_function
          (formal_parameters)
          (expression
            (primary_expression
              (number))))))))

==================
Arrow function single param
==================
{{ v => 42 }}
---
(template
  (output_directive
    (expression
      (primary_expression
        (arrow_function
          (identifier)
          (expression
            (primary_expression
              (number))))))))
